export default {
  name: '平行线组',
  type: 'parallel',
  html: `<h4>Parallel (折线图) 配置参数</h4>`,
  data: [
    {
      name: '基础平行线组',
      data: {
        keys: ['店铺', ['客流', '人'], ['租金', '元'], ['去重客流', '人']],
        values: [
          { 店铺: '1/1', 客流: 1393, 租金: 1093, 去重客流: 0.1 },
          { 店铺: '1/2', 客流: 3530, 租金: 3230, 去重客流: 0.2 },
          { 店铺: '1/3', 客流: 2923, 租金: 2623, 去重客流: 0.3 },
          { 店铺: '1/4', 客流: 1723, 租金: 1423, 去重客流: 4.9 },
          { 店铺: '1/5', 客流: 3792, 租金: 3492, 去重客流: 2.1 },
          { 店铺: '1/6', 客流: 4593, 租金: 4293, 去重客流: 3.4 },
        ],
      },
      settings: {
        seriesData: [
          {
            name: '1/1',
            value: 27,
          },
          {
            name: '1/2',
            value: 27,
          },
          {
            name: '1/3',
            value: 27,
          },
          {
            name: '1/4',
            value: 27,
          },
          {
            name: '1/5',
            value: 27,
          },
          {
            name: '1/6',
            value: 27,
          },
        ],
      },
      extra: {},
    },
  ],
}
